zhanghongchen1213/Electronic_Wooden_Fish/Embedded/sdkconfig.defaults
# 电子木鱼 EWF 固件默认配置（Story 1.1：电源、启动绑带与 BSP 自检）
# 事实源：docs/hardware/电子木鱼-硬件原理图设计基线.md、docs/hardware/电源网络命名规范.md

# 目标芯片固定为 ESP32-S3（显式写入，保证干净构建目录也能得到正确 target）
CONFIG_IDF_TARGET="esp32s3"

# 16 MB Flash、DIO、80 MHz 与当前无 OTA 的紧凑自定义分区
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM：屏幕双缓冲与后续 UI 需要；本 Story 只验证其初始化可用
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=73728

# ESP-IDF v5.5.4 ESP32-S3 动态调频与自动 light sleep
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
# 板级无 32.768 kHz 晶振，RTC 保持内部 RC。
CONFIG_RTC_CLK_SRC_INT_RC=y

# ESP32-S3 原生 USB Serial/JTAG 独占应用日志，释放 GPIO43/GPIO44 给 Air780EGP UART1
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# USB 主机连接期间禁止自动 light sleep，避免调试串口失联；拔线后不影响电池态自动休眠。
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# 屏幕 SPI 需要保持在 IRAM 内以配合后续高刷新
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPI_MASTER_IN_IRAM=y

# SPIFFS 镜像容器（内容由后续 Story 补齐）
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y

# Story 1.1 正式默认关闭开发台架自检自动运行
# CONFIG_EWF_BENCH_SELFTEST_AUTORUN is not set
